-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: localhost    Database: weixin
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `alldlist`
--

DROP TABLE IF EXISTS `alldlist`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `alldlist` (
  `cost` int DEFAULT NULL,
  `good_at` longtext,
  `hospital` varchar(45) DEFAULT NULL,
  `name` varchar(45) DEFAULT NULL,
  `post` varchar(45) DEFAULT NULL,
  `doctor_id` varchar(45) NOT NULL,
  `dep_id` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`doctor_id`),
  KEY `dep_id_idx` (`dep_id`),
  CONSTRAINT `dep_id` FOREIGN KEY (`dep_id`) REFERENCES `reglist` (`dep_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `alldlist`
--

LOCK TABLES `alldlist` WRITE;
/*!40000 ALTER TABLE `alldlist` DISABLE KEYS */;
INSERT INTO `alldlist` VALUES (51,'熟练掌握心血管疾病如高血压，冠心病，心力衰竭等疾病的诊治，尤其擅长心脏介入手术中的心脏起搏器植入及射频消融消融术。','遵义医科大学附属医院','杨波','主任医生','1001','1658914644201'),(51,'擅长高血压和冠心病的治疗。他对血管疾病的诊断和监测具有丰富经验，并善于制定个性化的治疗方案以满足患者的需求。','遵义医科大学附属医院','许平','主任医生','1002','1658914644201'),(31,'专注于心血管内窥镜检查和介入治疗。他在冠状动脉血管成形术、心脏起搏器植入等方面有着广泛的经验，是心脏介入治疗领域中的专家。','遵义医科大学附属医院','吴瑞','副主任医生','1003','1658914644201'),(31,'研究充血性心力衰竭等心脏病的病因学和治疗学。他在心血管病病因与药物治疗研究方面具有深入的学术造诣，致力于提供最先进的治疗方案。','遵义医科大学附属医院','李国艳','副主任医生','1004','1658914644201'),(20,'专注于心脏超声检查和心脏影像学。他具备丰富的心脏超声检查经验，能够提供准确的诊断结果，并依此进行治疗建议和随访。','遵义医科大学附属医院','于娜','主治医生','1005','1658914644201'),(31,'拥有丰富的临床经验，擅长治疗糖尿病和甲状腺疾病。他善于运用综合治疗方法，包括药物治疗和生活方式调整，以帮助患者管理疾病并提高生活质量。','遵义医科大学附属医院','黄浩','主任医生','2001','1658914644203'),(51,'专注于肾上腺疾病和性腺疾病的治疗。他具备广泛的知识和技术，在患者的诊断和治疗方面始终保持着最新的研究发展。','遵义医科大学附属医院','刘西平','副主任医生','2002','1658914644203'),(30,'关注甲状腺功能异常和骨质疏松等疾病。他在甲状腺超声、甲状腺活检等方面具备丰富的经验，并能够提供全面的诊断和治疗方案。','遵义医科大学附属医院','李立','主任医生','2003','1658914644203'),(25,'专长于垂体和生长激素疾病的治疗。他在生长发育异常、垂体瘤等方面具有丰富的临床经验，并能够提供个性化的治疗计划。','遵义医科大学附属医院','杨光磊','副主任医生 ','2004','1658914644203'),(25,'重视糖尿病和甲状腺疾病的管理。他积极探索最新的治疗方法和研究领域，并致力于提供最佳的治疗方案和健康建议。','遵义医科大学附属医院','张伟','主任医生','2005','1658914644203'),(51,'除擅长脑血管病的预防、诊治与康复外，尚专长于帕金森病等神经变性病、癫痫及神经内科疑难病的诊治。','遵义医科大学附属医院','郝星','主任医生','3001','1658914644205'),(51,'脑血管病、帕金森病、认知障碍、神经心理疾病及神经科疑难病的诊治。','遵义医科大学附属医院','张璇','副主任医生','3002','1658914644205'),(40,'擅长脑血管病、帕金森病、认知障碍，重症肌无力、癫痫、失眠症，头晕等疾病的诊治。','遵义医科大学附属医院','王小英','主治医生','3003','1658914644205'),(40,'擅长脑血管病的规范诊治及神经介入围手术期救治、头晕、头痛、神经免疫脱髓鞘性疾病、神经系统感染性疾病、癫痫、帕金森病以及神经系统疑难危重症等的诊治。','遵义医科大学附属医院','廖鑫','副主任医生','3004','1658914644205'),(31,'擅长帕金森病、脑卒中、头晕、焦虑抑郁等疾病诊治，','遵义医科大学附属医院','李思城','主治医生','3005','1658914644205'),(51,'专注于肾上腺疾病和性腺疾病的治疗。他具备广泛的知识和技术，在患者的诊断和治疗方面始终保持着最新的研究发展。','遵义医科大学附属医院','杨光磊','科室主任','4001','1658914644203'),(31,'擅长帕金森病、脑卒中、头晕、焦虑抑郁等疾病诊治，尤其擅长帕金森病等疾病','遵义医科大学附属医院','张伟','主治医生','4002','1658914644204'),(30,'专注于肾上腺疾病和性腺疾病的治疗。他具备广泛的知识和技术，在患者的诊断和治疗方面始终保持着最新的研究发展。','遵义医科大学附属医院','郝星','副主任医生','4003','1658914644205'),(20,'拥有丰富的临床经验，擅长治疗糖尿病和甲状腺疾病。他善于运用综合治疗方法，包括药物治疗和生活方式调整，以帮助患者管理疾病并提高生活质量。','遵义医科大学附属医院','张璇','主治医生','4004','1658914644205'),(24,'拥有丰富的临床经验，擅长治疗糖尿病和甲状腺疾病。他善于运用综合治疗方法，包括药物治疗和生活方式调整，以帮助患者管理疾病并提高生活质量。','遵义医科大学附属医院','王小英','门诊医生','4005','1658914644205'),(80,'从事妇产科专业20余年，在妇科及产科方面均有丰富的临床经验，擅长于各类病理产科处理、急重症病人抢救、妇科肿瘤及不孕症的诊治，具有解决疑难复杂问题的能力','遵义医科大学附属医院','廖鑫','主任','4006','1658914644205'),(90,'在妇科、产科、不孕症的诊治方面，具有丰富的临床经验，擅长疑难病症的诊治、急危重症病人的抢救，尤其在处理高危妊娠、妊娠合并及并发症等病理产科方面临床经验丰富。','遵义医科大学附属医院','李思城','副主任','5001','1658914644205'),(50,'擅长妇科常见病、妇科肿瘤及生殖内分泌疾病诊断与治疗，对于生殖道畸形的矫正和多囊卵巢综合病理生理及其诊断与治疗进行过专题研究，在妇科宫、腹腔镜手术、宫颈病变及难治性阴道炎诊断与治疗、不孕症的诊断与治疗、生殖内分泌疾病','遵义医科大学附属医院','杨波','副主任','5002','1658914644205'),(30,'具有丰富的临床工作经验，基础理论扎实，能熟练进行妇产科常见病、多发疾的诊治及危急重症患者的抢救工作，妇科宫、腹腔镜微创手术操作娴熟，尤其擅长对卵巢肿瘤、子宫肌瘤、子宫内膜异位症等疾病的诊治','遵义医科大学附属医院','许平','副主任','5003','1658914644205'),(31,'擅长脑血管病的规范诊治及神经介入围手术期救治、头晕、头痛、神经免疫脱髓鞘性疾病、神经系统感染性疾病、癫痫、帕金森病以及神经系统疑难危重症等的诊治。','遵义医科大学附属医院','吴瑞','副主任','6001','1658914644207'),(51,'擅长脑血管病、帕金森病、认知障碍，重症肌无力、癫痫、失眠症，头晕等疾病的诊治。','遵义医科大学附属医院','李国艳','主治医生','6002','1658914644207'),(51,'脑血管病、帕金森病、认知障碍、神经心理疾病及神经科疑难病的诊治。','遵义医科大学附属医院','于娜','主治医生','6003','1658914644207'),(30,'除擅长脑血管病的预防、诊治与康复外，尚专长于帕金森病等神经变性病、癫痫及神经内科疑难病的诊治。','遵义医科大学附属医院','黄浩','主治医生','6004','1658914644207'),(25,'重视糖尿病和甲状腺疾病的管理。他积极探索最新的治疗方法和研究领域，并致力于提供最佳的治疗方案和健康建议。','遵义医科大学附属医院','刘亦志','主治医生','6005','1658914644207'),(40,'专长于垂体和生长激素疾病的治疗。他在生长发育异常、垂体瘤等方面具有丰富的临床经验，并能够提供个性化的治疗计划。','遵义医科大学附属医院','陈伟蓉','主治医生','7001','1658914644207'),(30,'关注甲状腺功能异常和骨质疏松等疾病。他在甲状腺超声、甲状腺活检等方面具备丰富的经验，并能够提供全面的诊断和治疗方案。','遵义医科大学附属医院','吴明星','主任','7002','1658914644201'),(20,'专注于肾上腺疾病和性腺疾病的治疗。他具备广泛的知识和技术，在患者的诊断和治疗方面始终保持着最新的研究发展。','遵义医科大学附属医院','郑丹莹','主任','7003','1658914644207'),(21,'拥有丰富的临床经验，擅长治疗糖尿病和甲状腺疾病。他善于运用综合治疗方法，包括药物治疗和生活方式调整，以帮助患者管理疾病并提高生活质量。','遵义医科大学附属医院','毛欣杰','主治医生','7004','1658914644201'),(40,'专注于心脏超声检查和心脏影像学。他具备丰富的心脏超声检查经验，能够提供准确的诊断结果，并依此进行治疗建议和随访。','遵义医科大学附属医院','蒋玲玲','副主任医生','7005','1658914644201'),(50,'研究充血性心力衰竭等心脏病的病因学和治疗学。他在心血管病病因与药物治疗研究方面具有深入的学术造诣，致力于提供最先进的治疗方案。','遵义医科大学附属医院','王何瑞','主治医生','8001','1658914644201'),(35,'专注于心血管内窥镜检查和介入治疗。他在冠状动脉血管成形术、心脏起搏器植入等方面有着广泛的经验，是心脏介入治疗领域中的专家。','遵义医科大学附属医院','张娜娜','主治医生','8002','1658914644201');
/*!40000 ALTER TABLE `alldlist` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-07-27 14:59:57
